{
  "title": "Andrey - Portfolio",
  "position": "Full Stack Developer",
  "about": "About me",
  "cv": "Download CV",
  "cv_explanation": "Download my CV <br><i>Select your preferred language<br> to download the corresponding version.</i>",
  "work": "Experience",
  "contact": "Contact",
  "home": "Home",
  "NotFound": "Oops! Looks like you're lost in space.",
  "skills": "Skills",
  "education": "Education",
  "background": "Background",
  "castro_carazo": "Castro Carazo University",
  "castro_carazo_degree": "Bachelor of Computer Engineering",
  "castro_carazo_description": "During my studies, I developed complete web applications with <strong>modern technologies</strong>, consolidating my skills in <strong>software engineering</strong>. I learned about <strong>networks</strong> and <strong>computer architecture</strong>, gaining a deep understanding of the <strong>technological infrastructure</strong> that supports applications.</p><p style='margin-top: 20px;'>My training included an intensive focus on <strong>algorithms</strong> and <strong>data structures</strong>, solving complex problems and optimizing solutions. I also participated in group projects that simulated real work environments, strengthening my competencies in <strong>teamwork</strong> and <strong>project management</strong>.</p><p style='margin-top: 20px;'>This learning covered all phases of the software life cycle, from <strong>requirements gathering</strong> to <strong>design</strong>, <strong>development</strong>, <strong>testing</strong>, and <strong>implementation</strong>, giving me a comprehensive perspective to create <strong>effective software solutions</strong> aligned with <strong>user needs</strong> and <strong>business objectives</strong>.",
  "soft_skills": "Soft Skills",
  "tools": "Tools",
  "problem_solving": "Problem Solving",
  "leadership": "Leadership",
  "agile_methodologies": "Agile Methodologies",
  "success": "Success",
  "backend": "Backend",
  "frontend": "Frontend",
  "steve_quote": "The only way to do great work is to love what you do. - Steve Jobs",
  "about_1": "I’m a developer driven by a desire to understand the 'why' behind every line of code. My passion lies in solving real-world problems with technology, creating solutions that feel natural, intuitive, and purposeful.",
  "about_2": "While I specialize in full-stack development, I see myself as a problem solver at heart. Whether it's optimizing user experiences or building robust backends, I’m always focused on creating clean, efficient, and meaningful code that serves the bigger picture.",
  "contact_me": "Get in Touch",
  "contact_info": "Contact Information",
  "contact_form": {
    "name": "Your Name",
    "email": "Your Email",
    "message": "Your Message",
    "send": "Send Message",
    "success": "Message sent successfully!",
    "follow_up": "Thank you for taking the time to write. I'll get back to you as soon as possible."
  },
  "showmore": "Show More",
  "showless": "Show Less",
  "highschool": "Alajuelita Technical Professional High School",
  "highschool_degree": "Bachelor of Business Informatics",
  "highschool_description": "During my high school education, I acquired basic knowledge in <strong>programming</strong>, <strong>database administration</strong>, <strong>networks</strong>, <strong>hardware</strong>, and <strong>software</strong>. I participated in <strong>software development</strong> and <strong>system maintenance</strong> projects, strengthening my skills in <strong>problem solving</strong> and <strong>teamwork</strong>. My technical training provided me with a solid foundation to continue my studies in <strong>computer engineering</strong> and develop my career in the field of <strong>technology</strong>.",
  "work_experience": "Work Experience",
  "personal_projects": "Personal Projects",
  "workexperience": {
    "simetria": {
      "position": "Full Stack Developer Intern",
      "period": "Sep 2024 - Dec 2024",
      "description_1": "I developed a <strong>complete application</strong>, from <strong>database design</strong> to <strong>user interface implementation</strong>, ensuring a functional and efficient product.",
      "description_2": "Collaborated with a team of developers to <strong>optimize the application architecture</strong> and enhance the <strong>user experience</strong> through <strong>agile methodology</strong>.",
      "description_3": "Designed and implemented <strong>backend and frontend features</strong> using <strong>modern technologies</strong> such as <strong>.NET Core</strong>, <strong>React</strong>, and <strong>MySQL</strong>, ensuring robust development.",
      "description_4": "Participated in <strong>planning meetings</strong> and <strong>code reviews</strong> to ensure the <strong>quality</strong> and <strong>consistency</strong> of the final product."
    },
    "fcs": {
      "position": "Full Stack Developer",
      "period": "Feb 2025 - Present",
      "description_1": "Develop <strong>custom web applications</strong> integrated with <strong>SAP Business One</strong>, tailoring solutions to meet each client's unique operational needs.",
      "description_2": "Design and build <strong>REST APIs</strong> connected to the <strong>SAP B1 Service Layer</strong>, utilizing <strong>SQL</strong> or <strong>HANA queries</strong> based on client infrastructure.",
      "description_3": "Utilize <strong>Firebase</strong> and <strong>Firestore</strong> to manage <strong>authentication</strong>, <strong>dynamic permissions</strong>, and <strong>real-time updates</strong> via listeners.",
      "description_4": "Perform <strong>system maintenance</strong> and implement <strong>feature enhancements</strong> to align with evolving business requirements."
    }
  },
  "personalprojects": {
    "portfolio": {
      "title": "Personal Website",
      "description": "I developed my personal portfolio to showcase my skills and projects. I used <strong>React</strong> and libraries like <strong>React-Router</strong>, <strong>i18Next</strong>,<strong> Framer motion </strong>, with the help of <strong>TailwindCSS</strong> for styling, creating a complete web application with a modern and functional design."
    },
    "gymapp": {
      "title": "Gym App",
      "description": "I am developing a <strong>modular Full-Stack application</strong> for gym management, leveraging a <strong>multi-layered architecture</strong> for <strong>scalability</strong>, <strong>flexibility</strong>, and <strong>maintainability</strong>. The project is a <strong>work in progress</strong>, focusing on features like <strong>role-based access control</strong>, <strong>user and gym entity management</strong>, <strong>secure authentication</strong>, and <strong>performance optimization</strong> using <strong>modern technologies</strong> such as Java, Spring Boot, Next.js, and Tailwind CSS."
    },
    "livepulse": {
      "title": "Live Pulse",
      "description": "This <strong>full-stack project</strong> is a <strong>live streaming platform</strong> that combines a <strong>modern React frontend</strong> with a <strong>Spring Boot microservice backend</strong>. It enables users to <strong>stream video</strong>, interact via <strong>real-time chat</strong>, follow <strong>streamers</strong>, and manage profiles. The system emphasizes an <strong>event-driven architecture</strong>, <strong>real-time communication</strong>, and <strong>scalability</strong>, with features like <strong>chat message</strong> persistence."
    }
  },
  "details": {
    "gymapp": {
      "title": "Gym App",
      "description": "<p>A full-stack web application designed to manage gym memberships, user authentication, and other related functionalities. Built with a modular backend architecture and a modern frontend stack, this project is currently in its early stages of development.</p><p>The App aims to streamline gym operations by offering features such as role-based access control, user and gym entity management, and secure authentication. While the backend provides a robust and scalable foundation, the frontend offers an intuitive and responsive user interface.</p>",
      "startDate": "December 2024",
      "team": "2 Developers",
      "duration": "Still in development",
      "features": {
        "rolePermissionManagement": "Role-based access control with dynamic permissions for users such as admins, coaches, and gym members.",
        "authenticationAuthorization": "Secure JWT-based authentication with features for login, registration, and password recovery.",
        "gymUserManagement": "Functionality for creating, editing, and managing gym and user entities.",
        "emailIntegration": "Email services for account verification and password reset using SendGrid.",
        "performanceOptimization": "Caching mechanisms implemented with Redis for faster data retrieval.",
        "deploymentReady": "Dockerized for seamless deployment and scalability."
      }
    },
    "livepulse": {
      "title": "Live Pulse",
      "description": "<p>This full-stack project is a live streaming platform that combines a modern frontend with React and TypeScript, and a microservice-based backend with Spring Boot. It allows users to stream videos, interact via real-time chat, follow streamers, and manage profiles. The system emphasizes an event-driven architecture, real-time communication, and scalability.</p>",
      "duration": "3 weeks",
      "features": {
        "realTimeInteraction": "Real-time chat based on WebSocket/STOMP with persistence in MongoDB via Kafka, audience metrics with Redis, and event-driven notifications powered by Kafka.",
        "streamManagement": "RTMP/HLS video streaming with transcoding using Nginx-RTMP and FFmpeg, thumbnail generation with FFmpeg, and metadata storage in MongoDB.",
        "userExperience": "Streamer following system with real-time updates, profile management, and responsive design with Tailwind CSS.",
        "eventDrivenArchitecture": "Use of Kafka for message flows and stream lifecycle, and Redis Pub/Sub for metrics updates.",
        "scalableMicroservices": "Scalable microservices with Docker and Kafka.",
        "hybridCommunication": "Hybrid communication (WebSocket + SSE + Redis) to balance performance and complexity.",
        "dataPersistence": "Resilient data persistence, such as chat messages stored post-stream to reduce load.",
        "adaptiveStreaming": "Adaptive streaming with HLS/DASH to ensure dynamic quality.",
        "productionReady": "Production practices like API testing with Postman, CORS configuration, and monitoring with Spring Boot Actuator.",
        "mobileFirstDesign": "Mobile-first design with Tailwind CSS and performance optimizations with React Query."
      }
    }
  },
  "codigo": "View Code",
  "viewDetails": "View more details",
  "about_project": "About the project",
  "demo": "View live demo",
  "key_features": "Key Features",
  "tech_stack": "Tech Stack",
  "project_overview": "Project Overview",
  "started": "Started",
  "duration": "Duration",
  "team": "Team",
  "project_gallery": "Project Gallery"
}
