{
  "title": "Andrey - Portfolio",
  "position": "Full Stack Developer",
  "about": "About me",
  "cv": "Download CV",
  "work": "Experience",
  "contact": "Contact",
  "home": "Home",
  "NotFound": "Oops! Looks like you're lost in space.",
  "skills": "Skills",
  "education": "Education",
  "background": "Background",
  "castro_carazo": "Castro Carazo University",
  "castro_carazo_degree": "Bachelor of Computer Engineering",
  "castro_carazo_description": "During my studies, I developed complete web applications with <strong>modern technologies</strong>, consolidating my skills in <strong>software engineering</strong>. I learned about <strong>networks</strong> and <strong>computer architecture</strong>, gaining a deep understanding of the <strong>technological infrastructure</strong> that supports applications.</p><p style='margin-top: 20px;'>My training included an intensive focus on <strong>algorithms</strong> and <strong>data structures</strong>, solving complex problems and optimizing solutions. I also participated in group projects that simulated real work environments, strengthening my competencies in <strong>teamwork</strong> and <strong>project management</strong>.</p><p style='margin-top: 20px;'>This learning covered all phases of the software life cycle, from <strong>requirements gathering</strong> to <strong>design</strong>, <strong>development</strong>, <strong>testing</strong>, and <strong>implementation</strong>, giving me a comprehensive perspective to create <strong>effective software solutions</strong> aligned with <strong>user needs</strong> and <strong>business objectives</strong>.",
  "soft_skills": "Soft Skills",
  "tools": "Tools",
  "problem_solving": "Problem Solving",
  "leadership": "Leadership",
  "agile_methodologies": "Agile Methodologies",
  "success": "Success",
  "backend": "Backend",
  "frontend": "Frontend",
  "steve_quote": "The only way to do great work is to love what you do. - Steve Jobs",
  "about_1": "I’m a developer driven by a desire to understand the 'why' behind every line of code. My passion lies in solving real-world problems with technology, creating solutions that feel natural, intuitive, and purposeful.",
  "about_2": "While I specialize in full-stack development, I see myself as a problem solver at heart. Whether it's optimizing user experiences or building robust backends, I’m always focused on creating clean, efficient, and meaningful code that serves the bigger picture.",
  "contact_me": "Get in Touch",
  "contact_info": "Contact Information",
  "contact_form": {
    "name": "Your Name",
    "email": "Your Email",
    "message": "Your Message",
    "send": "Send Message",
    "success": "Message sent successfully!",
    "follow_up": "Thank you for taking the time to write. I'll get back to you as soon as possible."
  },
  "highschool": "Alajuelita Technical Professional High School",
  "highschool_degree": "Bachelor of Business Informatics",
  "highschool_description": "During my high school education, I acquired basic knowledge in <strong>programming</strong>, <strong>database administration</strong>, <strong>networks</strong>, <strong>hardware</strong>, and <strong>software</strong>. I participated in <strong>software development</strong> and <strong>system maintenance</strong> projects, strengthening my skills in <strong>problem solving</strong> and <strong>teamwork</strong>. My technical training provided me with a solid foundation to continue my studies in <strong>computer engineering</strong> and develop my career in the field of <strong>technology</strong>."
}
